aroyer-qc/Digini/Peripheral/inc/port/STM32H7xx/lib_class_STM32H7_fmc.h
//-------------------------------------------------------------------------------------------------
//
//  File : lib_class_STM32F7_fmc.h
//
//-------------------------------------------------------------------------------------------------
//
// Copyright(c) 2021 Alain Royer.
// Email: aroyer.qc@gmail.com
//
// Permission is hereby granted, free of charge, to any person obtaining a copy of this software
// and associated documentation files (the "Software"), to deal in the Software without
// restriction, including without limitation the rights to use, copy, modify, merge, publish,
// distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all copies or
// substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
// INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
// AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
// DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
//
//-------------------------------------------------------------------------------------------------

#pragma once


// this won't be develop... i preferred using independant driver for SRAM, NOR, NAND and SDRAM (less complicated)

//-------------------------------------------------------------------------------------------------
// Include file(s)
//-------------------------------------------------------------------------------------------------

#include "stm32f7xx.h"
#include "./Digini/inc/lib_typedef.h"

//-------------------------------------------------------------------------------------------------
// Define(s)
//-------------------------------------------------------------------------------------------------

#if defined (DIGINI_USE_SRAM_MODULE) || defined(DIGINI_USE_NOR_MODULE) || defined(DIGINI_USE_NAND_MODULE) || defined(USE_SDRAM_DRIVER)

// FMC_NORSRAM_Bank FMC NOR/SRAM Bank
#define FMC_NORSRAM_BANK1                               ((uint32_t)0x00000000U)
#define FMC_NORSRAM_BANK2                               ((uint32_t)0x00000002U)
#define FMC_NORSRAM_BANK3                               ((uint32_t)0x00000004U)
#define FMC_NORSRAM_BANK4                               ((uint32_t)0x00000006U)
// FMC_Data_Address_Bus_Multiplexing FMC Data Address Bus Multiplexing
#define FMC_DATA_ADDRESS_MUX_DISABLE                    ((uint32_t)0x00000000U)
#define FMC_DATA_ADDRESS_MUX_ENABLE                     ((uint32_t)0x00000002U)

// FMC_Memory_Type FMC Memory Type
#define FMC_MEMORY_TYPE_SRAM                            ((uint32_t)0x00000000U)
#define FMC_MEMORY_TYPE_PSRAM                           ((uint32_t)0x00000004U)
#define FMC_MEMORY_TYPE_NOR                             ((uint32_t)0x00000008U)

// FMC_NORSRAM_Data_Width FMC NORSRAM Data Width
#define FMC_NORSRAM_MEM_BUS_WIDTH_8                     ((uint32_t)0x00000000U)
#define FMC_NORSRAM_MEM_BUS_WIDTH_16                    ((uint32_t)0x00000010U)
#define FMC_NORSRAM_MEM_BUS_WIDTH_32                    ((uint32_t)0x00000020U)

// FMC_NORSRAM_Flash_Access FMC NOR/SRAM Flash Access
#define FMC_NORSRAM_FLASH_ACCESS_ENABLE                 ((uint32_t)0x00000040U)
#define FMC_NORSRAM_FLASH_ACCESS_DISABLE                ((uint32_t)0x00000000U)

// FMC_Burst_Access_Mode FMC Burst Access Mode
#define FMC_BURST_ACCESS_MODE_DISABLE                   ((uint32_t)0x00000000U)
#define FMC_BURST_ACCESS_MODE_ENABLE                    ((uint32_t)0x00000100U)

// FMC_Wait_Signal_Polarity FMC Wait Signal Polarity
#define FMC_WAIT_SIGNAL_POLARITY_LOW                    ((uint32_t)0x00000000U)
#define FMC_WAIT_SIGNAL_POLARITY_HIGH                   ((uint32_t)0x00000200U)

// FMC_Wait_Timing FMC Wait Timing
#define FMC_WAIT_TIMING_BEFORE_WS                       ((uint32_t)0x00000000U)
#define FMC_WAIT_TIMING_DURING_WS                       ((uint32_t)0x00000800U)

// FMC_Write_Operation FMC Write Operation
#define FMC_WRITE_OPERATION_DISABLE                     ((uint32_t)0x00000000U)
#define FMC_WRITE_OPERATION_ENABLE                      ((uint32_t)0x00001000U)
// FMC_Wait_Signal FMC Wait Signal
#define FMC_WAIT_SIGNAL_DISABLE                         ((uint32_t)0x00000000U)
#define FMC_WAIT_SIGNAL_ENABLE                          ((uint32_t)0x00002000U)

// FMC_Extended_Mode FMC Extended Mode
#define FMC_EXTENDED_MODE_DISABLE                       ((uint32_t)0x00000000U)
#define FMC_EXTENDED_MODE_ENABLE                        ((uint32_t)0x00004000U)

// FMC_AsynchronousWait FMC Asynchronous Wait
#define FMC_ASYNCHRONOUS_WAIT_DISABLE                   ((uint32_t)0x00000000U)
#define FMC_ASYNCHRONOUS_WAIT_ENABLE                    ((uint32_t)0x00008000U)

// FMC_Page_Size FMC Page Size
#define FMC_PAGE_SIZE_NONE                              ((uint32_t)0x00000000U)
#define FMC_PAGE_SIZE_128                               ((uint32_t)FMC_BCR1_CPSIZE_0)
#define FMC_PAGE_SIZE_256                               ((uint32_t)FMC_BCR1_CPSIZE_1)
#define FMC_PAGE_SIZE_512                               ((uint32_t)(FMC_BCR1_CPSIZE_0 | FMC_BCR1_CPSIZE_1))
#define FMC_PAGE_SIZE_1024                              ((uint32_t)FMC_BCR1_CPSIZE_2)
// FMC_Write_Burst FMC Write Burst
#define FMC_WRITE_BURST_DISABLE                         ((uint32_t)0x00000000U)
#define FMC_WRITE_BURST_ENABLE                          ((uint32_t)0x00080000U)

// FMC_Continous_Clock FMC Continuous Clock
#define FMC_CONTINUOUS_CLOCK_SYNC_ONLY                  ((uint32_t)0x00000000U)
#define FMC_CONTINUOUS_CLOCK_SYNC_ASYNC                 ((uint32_t)0x00100000U)

// FMC_Write_FIFO FMC Write FIFO
#define FMC_WRITE_FIFO_DISABLE                          ((uint32_t)FMC_BCR1_WFDIS)
#define FMC_WRITE_FIFO_ENABLE                           ((uint32_t)0x00000000U)

// FMC_Access_Mode FMC Access Mode
#define FMC_ACCESS_MODE_A                               ((uint32_t)0x00000000U)
#define FMC_ACCESS_MODE_B                               ((uint32_t)0x10000000U)
#define FMC_ACCESS_MODE_C                               ((uint32_t)0x20000000U)
#define FMC_ACCESS_MODE_D                               ((uint32_t)0x30000000)

// FMC_NAND_Bank FMC NAND Bank
#define FMC_NAND_BANK3                                  ((uint32_t)0x00000100U)

// FMC_Wait_feature FMC Wait feature
#define FMC_NAND_WAIT_FEATURE_DISABLE                   ((uint32_t)0x00000000U)
#define FMC_NAND_WAIT_FEATURE_ENABLE                    ((uint32_t)0x00000002U)

// FMC_PCR_Memory_Type FMC PCR Memory Type
#define FMC_PCR_MEMORY_TYPE_NAND                        ((uint32_t)0x00000008U)

// FMC_NAND_Data_Width FMC NAND Data Width
#define FMC_NAND_MEM_BUS_WIDTH_8                        ((uint32_t)0x00000000U)
#define FMC_NAND_MEM_BUS_WIDTH_16                       ((uint32_t)0x00000010U)

// FMC_ECC FMC ECC
#define FMC_NAND_ECC_DISABLE                            ((uint32_t)0x00000000U)
#define FMC_NAND_ECC_ENABLE                             ((uint32_t)0x00000040U)

